Documents/ГорныеРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ГорныеРаботы</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оборудование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаПоПлану</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ГорныеРаботы/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
// Обработчик изменения номенклатуры в строке таблицы
Процедура РаботыНоменклатураПриИзменении(Элемент)
    
    // Получаем текущую строку
    ТекущаяСтрока = Элементы.Работы.ТекущиеДанные;
    Если ТекущаяСтрока = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    // Получаем выбранную номенклатуру
    Номенклатура = ТекущаяСтрока.Номенклатура;
    Если ЗначениеЗаполнено(Номенклатура) Тогда
        // Получаем данные номенклатуры
        ДанныеНоменклатуры = ПолучитьДанныеНоменклатуры(Номенклатура);
        Если ДанныеНоменклатуры <> Неопределено Тогда
            // Заполняем единицу измерения
            ТекущаяСтрока.ЕдиницаИзмерения = ДанныеНоменклатуры.ЕдиницаИзмерения;
        КонецЕсли;
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеНоменклатуры(СсылкаНоменклатуры)
    
    Если Не ЗначениеЗаполнено(СсылкаНоменклатуры) Тогда
        Возврат Неопределено;
    КонецЕсли;
    
    // Запрашиваем данные номенклатуры из базы
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |    Номенклатура.Ссылка,
        |    Номенклатура.ЕдиницаИзмерения
        |ИЗ
        |    Справочник.Номенклатура КАК Номенклатура
        |ГДЕ
        |    Номенклатура.Ссылка = &Ссылка";
    
    Запрос.УстановитьПараметр("Ссылка", СсылкаНоменклатуры);
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        // Возвращаем структуру с данными
        Данные = Новый Структура;
        Данные.Вставить("ЕдиницаИзмерения", Выборка.ЕдиницаИзмерения);
        Возврат Данные;
    КонецЕсли;
    
    Возврат Неопределено;
    
КонецФункции
